export interface CameraItem {
  id: string;
  name: string;
  type: string;
  lens: string;
  shutter: string;
  filmType: string;
  story: string;
  modelFile: string;
}

export const CAMERAS_DATA: CameraItem[] = [
  {
    id: 'fed2',
    name: 'ФЭД-2 (Боевой фотоаппарат)',
    type: 'Шкальный дальномерный фотоаппарат',
    lens: 'Индустар-26М 1:2.8 F=5cm',
    shutter: 'Шторно-щелевой (от 1/30 до 1/500 с + В)',
    filmType: 'Черно-белая 35-мм перфорированная пленка',
    story: 'Тяжелый цельнометаллический советский фотоаппарат, доставшийся Алексею по наследству от демобилизовавшихся сослуживцев. Прошел все боевые рейды 4-й роты 350-го гвардейского полка. Не боялся ни песка, ни пыли, ни ударов о броню БТРа. Именно на него сделан снимок боя на Гардезской дороге.',
    modelFile: './models/cameras/camera_fed2.glb'
  },
  {
    id: 'zenit',
    name: '«Зенит» (Зеркальная классика)',
    type: 'Однообъективный зеркальный фотоаппарат (SLR)',
    lens: 'Гелиос-44-2 2/58',
    shutter: 'Шторный, 1/30–1/500 с, синхронизация со вспышкой',
    filmType: 'Цветная слайдовая (обращаемая) пленка ORWO / Свема',
    story: 'Привезен офицерами полка из отпусков в Союзе, когда стало ясно, что рядовой Козлов обладает редким даром фотохудожника. Использовался для редких цветных слайдов и официальной фотосъемки бойцов на партийные и комсомольские билеты.',
    modelFile: './models/cameras/camera_zenit.glb'
  },
  {
    id: 'smena8m',
    name: '«Смена-8М» (Ферганская учебка)',
    type: 'Компактный шкальный фотоаппарат',
    lens: 'Триплет Т-43 4/40',
    shutter: 'Центральный залинзовый, 1/15–1/250 с + В',
    filmType: '35-мм фотопленка',
    story: 'Самый массовый фотоаппарат в истории. В ферганском учебном центре ВДВ кочевал от призыва к призыву. На него новобранец Алексей Козлов сделал свои первые армейские кадры, моментально разошедшиеся по дембельским альбомам сослуживцев.',
    modelFile: './models/cameras/camera_smena8m.glb'
  }
];
